package net.zhaiji.chestcavitybeyond.util;

/**
 * 个人数学不好，写一个工具类将输入和输出值列出来
 */
public class MathUtil {
    /**
     * 正比缩放
     *
     * <pre>
     *  input | output
     * -------|---------
     *   4.0  | 7.389
     *   3.5  | 5.755
     *   3.0  | 4.482
     *   2.5  | 3.490
     *   2.0  | 2.718
     *   1.5  | 2.117
     *   1.0  | 1.649
     *   0.5  | 1.284
     *   0.0  | 1.000
     *  -0.5  | 0.779
     *  -1.0  | 0.607
     *  -1.5  | 0.472
     *  -2.0  | 0.368
     *  -2.5  | 0.287
     *  -3.0  | 0.223
     *  -3.5  | 0.173
     *  -4.0  | 0.135
     * </pre>
     *
     * @param input 输入值
     * @return 缩放因子
     */
    public static double getDirectExpScale(double input) {
        return Math.exp(0.5 * input);
    }

    /**
     * 反比缩放
     *
     * <pre>
     *  input | output
     * -------|---------
     *   4.0  | 0.135
     *   3.5  | 0.173
     *   3.0  | 0.223
     *   2.5  | 0.287
     *   2.0  | 0.368
     *   1.5  | 0.472
     *   1.0  | 0.607
     *   0.5  | 0.779
     *   0.0  | 1.000
     *  -0.5  | 1.284
     *  -1.0  | 1.649
     *  -1.5  | 2.117
     *  -2.0  | 2.718
     *  -2.5  | 3.490
     *  -3.0  | 4.482
     *  -3.5  | 5.755
     *  -4.0  | 7.389
     * </pre>
     *
     * @param input 输入值
     * @return 缩放因子
     */
    public static double getInverseExpScale(double input) {
        return Math.exp(-0.5 * input);
    }

    /**
     * 对数缩放
     *
     * <pre>
     *  input | output
     * -------|--------
     *   0.0  | 0.000
     *   0.5  | 0.223
     *   1.0  | 0.405
     *   1.5  | 0.560
     *   2.0  | 0.693
     *   2.5  | 0.811
     *   3.0  | 0.916
     *   3.5  | 1.013
     *   4.0  | 1.099
     * </pre>
     *
     * @param input 输入值
     * @return 缩放因子
     */
    public static double getLog1pScale(double input) {
        // 使用input的绝对值，忽略负数
        return Math.log1p(Math.abs(input) / 2);
    }

    /**
     * 衰减缩放
     *
     * <pre>
     * input > 0
     * value\input |  0.5  |  1.0  |  1.5  |  2.0  |  2.5  |  3.0  |  3.5  |  4.0
     * ------------|-------|-------|-------|-------|-------|-------|-------|------
     *      1      | 0.667 | 0.500 | 0.400 | 0.333 | 0.286 | 0.250 | 0.222 | 0.200
     *      2      | 0.800 | 0.667 | 0.571 | 0.500 | 0.444 | 0.400 | 0.364 | 0.333
     *      3      | 0.857 | 0.750 | 0.667 | 0.600 | 0.545 | 0.500 | 0.462 | 0.429
     *      4      | 0.889 | 0.800 | 0.727 | 0.667 | 0.615 | 0.571 | 0.533 | 0.500
     *      5      | 0.909 | 0.833 | 0.769 | 0.714 | 0.667 | 0.625 | 0.588 | 0.556
     *      6      | 0.923 | 0.857 | 0.800 | 0.750 | 0.706 | 0.667 | 0.632 | 0.600
     *      7      | 0.933 | 0.875 | 0.824 | 0.778 | 0.737 | 0.700 | 0.667 | 0.636
     *      8      | 0.941 | 0.889 | 0.842 | 0.800 | 0.762 | 0.727 | 0.696 | 0.667
     *      9      | 0.947 | 0.900 | 0.857 | 0.818 | 0.783 | 0.750 | 0.720 | 0.692
     *     10      | 0.952 | 0.909 | 0.870 | 0.833 | 0.800 | 0.769 | 0.741 | 0.714
     *
     * input <0
     * value\input | -0.5  | -1.0  | -1.5  | -2.0  | -2.5  | -3.0  | -3.5  | -4.0
     * ------------|-------|-------|-------|-------|-------|-------|-------|------
     *     any     | 1.223 | 1.405 | 1.560 | 1.693 | 1.811 | 1.916 | 2.013 | 2.099
     * </pre>
     *
     * @param value 衰减基准值
     * @param input 输入值
     * @return 缩放因子
     */
    public static double getAttenuationScale(double value, double input) {
        if (value == 0 || input == 0) {
            return 1;
        }
        if (input > 0) {
            return value / (value + input);
        }
        return 1 + getLog1pScale(input);
    }
}
